# IdeaStatiCa.RcsApi.Model.ConnectionData
Provides data of the connection

## Properties

Name | Type | Description | Notes
------------ | ------------- | ------------- | -------------
**ConnectionPoint** | **ReferenceElement** |  | [optional]
**Beams** | **List&lt;BeamData&gt;** | Connected beams | [optional]
**Plates** | **List&lt;PlateData&gt;** | Plates of the connection | [optional]
**FoldedPlates** | **List&lt;FoldedPlateData&gt;** | Folded plate of the connection | [optional]
**BoltGrids** | **List&lt;BoltGrid&gt;** | Bolt grids which belongs to the connection | [optional]
**AnchorGrids** | **List&lt;AnchorGrid&gt;** | Anchor grids which belongs to the connection | [optional]
**PinGrids** | **List&lt;PinGrid&gt;** | Pin grids which belongs to the connection | [optional]
**Welds** | **List&lt;WeldData&gt;** | Welds of the connection | [optional]
**ConcreteBlocks** | **List&lt;ConcreteBlockData&gt;** | ConcreteBlocksof the connection | [optional]
**CutBeamByBeams** | **List&lt;CutBeamByBeamData&gt;** | cut beam by beams | [optional]

[[Back to Model list]](../README.md#documentation-for-models) [[Back to API list]](../README.md#documentation-for-api-endpoints) [[Back to README]](../README.md)